# Improved shell history for zsh, bash, fish and nushell
brew "atuin"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Yet another cross-platform graphical process/system monitor
brew "bottom"
# Manage your dotfiles across multiple diverse machines, securely
brew "chezmoi"
# Command-line tool for getting & setting the default browser
brew "defaultbrowser"
# Load/unload environment variables based on $PWD
brew "direnv"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Fast and simple Node.js version manager
brew "fnm"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Polyglot runtime manager (asdf rust clone)
brew "mise"
# Painless compression and decompression for your terminal
brew "ouch"
# Modern replacement for ps written in Rust
brew "procs"
# Cross-shell prompt for astronauts
brew "starship"
# Very fast implementation of tldr in Rust
brew "tealdeer"
# Program that allows you to count code, quickly
brew "tokei"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# Display management tool
cask "betterdisplay"
# OpenAI's official ChatGPT desktop app
cask "chatgpt"
# Terminal-based AI coding assistant
cask "claude-code"
# OpenAI's coding agent that runs in your terminal
cask "codex"
# OpenAI's Codex desktop app for managing coding agents
cask "codex-app"
cask "font-gothic-a1"
cask "font-jetbrains-mono-nerd-font"
cask "font-monaspace"
cask "font-noto-sans-jp"
cask "font-noto-sans-kr"
cask "font-source-code-pro"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Web browser
cask "google-chrome"
# Companion app for Home Assistant home automation software
cask "home-assistant"
# Free and open-source media player
cask "iina"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Menu bar manager
cask "jordanbaird-ice"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Team communication and collaboration software
cask "slack"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "GarageBand", id: 682658836
mas "Home Assistant", id: 1099568401
mas "iMovie", id: 408981434
mas "Keynote", id: 361285480
mas "Keynote", id: 409183694
mas "Kindle", id: 302584613
mas "Numbers", id: 361304891
mas "Numbers", id: 409203825
mas "Pages", id: 361309726
mas "Pages", id: 409201541
mas "Pixelmator Pro", id: 1289583905
mas "RunCat", id: 1429033973
vscode "bracketpaircolordlw.bracket-pair-color-dlw"
vscode "christian-kohler.path-intellisense"
vscode "emilast.logfilehighlighter"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "github.github-vscode-theme"
vscode "keesschollaart.vscode-home-assistant"
vscode "kisstkondoros.vscode-gutter-preview"
vscode "lukas-tr.materialdesignicons-intellisense"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.live-server"
vscode "naumovs.color-highlight"
vscode "netcorext.uuid-generator"
vscode "oderwat.indent-rainbow"
vscode "pkief.material-icon-theme"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "shd101wyy.markdown-preview-enhanced"
vscode "svelte.svelte-vscode"
vscode "usernamehw.errorlens"
vscode "vincaslt.highlight-matching-tag"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscodevim.vim"
vscode "vunguyentuan.vscode-css-variables"
vscode "wholroyd.jinja"
